garyPenhook/PyAvrOCD/svd/atmega165a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USI</name>
      <description>Universal Serial Interface</description>
      <baseAddress>0x008000B8</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>USICR</name>
          <description>USI Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USITC</name>
              <description>Toggle Clock Port Pin</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USICLK</name>
              <description>Clock Strobe</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USICS</name>
              <description>USI Clock Source Select Bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USIWM</name>
              <description>USI Wire Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_WIRE_MODE</name>
                  <description>Three-Wire Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_WIRE_MODE</name>
                  <description>Two-Wire Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_WIRE_MODE_HELD_LOW</name>
                  <description>Two-Wire Mode Held Low</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USIOIE</name>
              <description>Counter Overflow Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USISIE</name>
              <description>Start Condition Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USIDR</name>
          <description>USI Data Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>USISR</name>
          <description>USI Status Register (read-only for debugger)</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USICNT</name>
              <description>USI Counter Value Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USIDC</name>
              <description>Data Output Collision</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USIPF</name>
              <description>Stop Condition Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USIOIF</name>
              <description>Counter Overflow Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USISIF</name>
              <description>Start Condition Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x00800060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCR</name>
          <description>Watchdog Timer Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDP</name>
              <description>Watch Dog Timer Prescaler bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_16K</name>
                  <description>Oscillator Cycles 16K</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_32K</name>
                  <description>Oscillator Cycles 32K</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_64K</name>
                  <description>Oscillator Cycles 64K</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_128K</name>
                  <description>Oscillator Cycles 128K</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_256K</name>
                  <description>Oscillator Cycles 256K</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_512K</name>
                  <description>Oscillator Cycles 512K</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_1024K</name>
                  <description>Oscillator Cycles 1024K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_2048K</name>
                  <description>Oscillator Cycles 2048K</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDE</name>
              <description>Watch Dog Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDCE</name>
              <description>Watchdog Change Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>